{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 4,
      "special": true,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "a": 5,
      "c": 6,
      "g": 7,
      "n": 8,
      "t": 9,
      "aa": 10,
      "tg": 11,
      "cc": 12,
      "ag": 13,
      "tt": 14,
      "tc": 15,
      "ac": 16,
      "gg": 17,
      "tgg": 18,
      "at": 19,
      "aag": 20,
      "tgc": 21,
      "agg": 22,
      "acc": 23,
      "tcc": 24,
      "agc": 25,
      "att": 26,
      "atg": 27,
      "aac": 28,
      "atc": 29,
      "ttc": 30,
      "ccc": 31,
      "ttg": 32,
      "gc": 33,
      "taa": 34,
      "tac": 35,
      "ggc": 36,
      "aaaa": 37,
      "tggc": 38,
      "agcc": 39,
      "tggg": 40,
      "agaa": 41,
      "tgcc": 42,
      "tttt": 43,
      "aggg": 44,
      "aggc": 45,
      "tag": 46,
      "aagc": 47,
      "aagg": 48,
      "gcc": 49,
      "tat": 50,
      "ttcc": 51,
      "atgg": 52,
      "tgtg": 53,
      "tccc": 54,
      "accc": 55,
      "attc": 56,
      "agac": 57,
      "atcc": 58,
      "atgc": 59,
      "tttc": 60,
      "tgaa": 61,
      "agag": 62,
      "tgtc": 63
    },
    "merges": [
      "a a",
      "t g",
      "c c",
      "a g",
      "t t",
      "t c",
      "a c",
      "g g",
      "tg g",
      "a t",
      "aa g",
      "tg c",
      "ag g",
      "a cc",
      "t cc",
      "ag c",
      "a tt",
      "a tg",
      "aa c",
      "a tc",
      "tt c",
      "cc c",
      "t tg",
      "g c",
      "t aa",
      "t ac",
      "gg c",
      "aa aa",
      "tgg c",
      "ag cc",
      "tg gg",
      "ag aa",
      "tg cc",
      "tt tt",
      "ag gg",
      "agg c",
      "t ag",
      "aag c",
      "aa gg",
      "g cc",
      "t at",
      "tt cc",
      "a tgg",
      "tg tg",
      "tcc c",
      "acc c",
      "att c",
      "ag ac",
      "at cc",
      "a tgc",
      "tt tc",
      "tg aa",
      "ag ag",
      "tg tc"
    ]
  }
}